internal/cli/testdata/golden/petstore-multi/topology.mmd
%% Architecture of petstore-multi, generated by cloudcc.
flowchart LR
    config_log_level{{"log_level\nconfig"}}
    execution_unit_api["api\nexecution_unit"]
    execution_unit_worker["worker\nexecution_unit"]
    expose_pet_api(["pet-api\nexpose"])
    persist_fs_petAudit[("petAudit\npersist_fs")]
    persist_kv_petsByOwner[("petsByOwner\npersist_kv")]
    persist_orm_auditdb[("auditdb\npersist_orm")]
    persist_orm_petsdb[("petsdb\npersist_orm")]
    persist_redis_petCache[("petCache\npersist_redis")]
    persist_secret_auditKey[("auditKey\npersist_secret")]
    pubsub_petEvents>"petEvents\npubsub"]
    static_unit_petstore_site[/"petstore-site\nstatic_unit"/]
    expose_pet_api -->|exposes| execution_unit_api
    execution_unit_api -->|publishes| pubsub_petEvents
    execution_unit_worker -.->|subscribes| pubsub_petEvents
    execution_unit_api -->|uses| config_log_level
    execution_unit_api -->|uses| persist_kv_petsByOwner
    execution_unit_api -->|uses| persist_orm_petsdb
    execution_unit_api -->|uses| persist_redis_petCache
    execution_unit_api -->|uses| pubsub_petEvents
    execution_unit_worker -->|uses| persist_fs_petAudit
    execution_unit_worker -->|uses| persist_kv_petsByOwner
    execution_unit_worker -->|uses| persist_orm_auditdb
    execution_unit_worker -->|uses| persist_secret_auditKey
    execution_unit_worker -->|uses| pubsub_petEvents
